In [1]:
import pandas as pd
import numpy as np

In [2]:
fx = pd.read_csv('fx_men.csv')
sr = pd.read_csv('sr_men.csv')
vt = pd.read_csv('vt_men.csv')
pb = pd.read_csv('pb_men.csv')
ph = pd.read_csv('ph_men.csv')
hb = pd.read_csv('hb_men.csv')

In [3]:
fxus=fx[fx['Country']=='USA']
srus=sr[sr['Country']=='USA']
vtus=vt[vt['Country']=='USA']
pbus=pb[pb['Country']=='USA']
phus=ph[ph['Country']=='USA']
hbus=hb[hb['Country']=='USA']

In [4]:
fx=fxus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
sr=srus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
vt=vtus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
pb=pbus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
ph=phus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])
hb=hbus.drop(columns=['Country', 'Competition', 'Round', 'year', 'Apparatus'])

In [5]:
fx

      Rank  D_Score  E_Score  Penalty  Score             name
52    49.0      4.5     7.65      0.0  12.15  saran alexander
53    16.0      4.9     8.55      0.0  13.45   javier alfonso
54     5.0      5.0     9.30      0.0  14.30   javier alfonso
55    12.0      5.0     8.20      0.0  13.20   javier alfonso
66    50.0      4.6     7.55      0.0  12.15    drake andrews
...    ...      ...      ...      ...    ...              ...
2082  32.0      4.8     6.95      0.0  11.75  ignacio yockers
2084   7.0      5.2     8.80      0.0  14.00       khoi young
2085   4.0      5.7     7.85      0.0  13.55       khoi young
2086   3.0      5.6     8.95      0.0  14.55       khoi young
2116  64.0      5.0     6.00      0.1  10.90  gavin zborowski

[217 rows x 6 columns]

# fx

In [6]:
fx['name'] = fx['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = fx['name'].value_counts()

# Filter out entries with only one occurrence
fx_filtered = fx[fx['name'].isin(name_counts.index[name_counts > 1])]

In [7]:
fx=fx_filtered.copy()
# Replace 'frederick richard' with 'frederick nathaniel richard' for consistency

# Group by the 'name' column and calculate the mean of other columns
fxavg = fx.groupby('name').mean().reset_index()

In [8]:
fxavg

,name,Rank,D_Score,E_Score,Penalty,Score
0,alex diab,9.500000,5.700000,7.675000,0.150000,13.225000
1,asher hong,10.875000,6.012500,7.895625,0.062500,13.845625
2,brody malone,29.250000,5.900000,7.674750,0.050000,13.524750
3,caleb melton,26.500000,5.600000,6.900000,0.050000,12.450000
4,cameron bock,12.400000,5.340000,8.243200,0.040000,13.543200
5,colin flores,24.000000,4.800000,8.275000,0.100000,12.975000
6,colt walker,38.800000,5.440000,7.423200,0.060000,12.803200
7,connor mccool,4.333333,5.966667,8.116667,0.000000,14.083333
8,daniel simmons,18.500000,5.300000,8.225000,0.100000,13.425000
9,donnell whittenburg,10.375000,6.200000,7.537375,0.100000,13.637375
10,evan hymanson,31.000000,5.375000,7.062500,0.200000,12.237500
11,fred richard,16.000000,5.850000,7.225000,0.000000,13.075000
12,frederick nathaniel richard,7.833333,5.983333,8.063667,0.016667,14.030333
13,garrett braunton,19.500000,5.550000,6.950000,0.000000,12.500000
14,ian gunther,25.000000,5.066667,7.683333,0.000000,12.750000
15,ian lasic-ellis,8.000000,5.650000,7.805333,0.000000,13.455333
16,isaiah drake,14.500000,5.400000,8.000000,0.000000,13.400000
17,jack freeman,11.666667,5.400000,8.083333,0.000000,13.483333
18,javier alfonso,11.000000,4.966667,8.683333,0.000000,13.650000
19,jeremy bischoff,16.500000,5.625000,7.375000,0.000000,13.000000
20,joshua andrew karnes,13.500000,5.300000,8.383000,0.000000,13.683000
21,joshua karnes,17.500000,5.300000,7.200000,0.000000,12.500000
22,kameron nelson,6.000000,6.000000,7.275000,0.025000,13.250000
23,kazuki hayashi,21.000000,5.400000,7.650000,0.000000,13.050000
24,khoi young,4.666667,5.500000,8.533333,0.000000,14.033333
25,landen blixt,26.500000,5.350000,7.745750,0.175000,12.920750
26,matt cormier,23.000000,5.725000,6.737500,0.175000,12.287500
27,michael artlip,17.000000,5.000000,8.183333,0.033333,13.150000
28,michael jaroh,35.250000,4.950000,6.912500,0.000000,11.862500
29,mike fletcher,35.666667,5.000000,6.966667,0.000000,11.966667
30,noah newfeld,26.500000,5.050000,6.975000,0.150000,11.875000
31,paul juda,12.000000,5.650000,8.562250,0.025000,14.187250
32,riley loos,8.000000,5.725000,7.924875,0.025000,13.624875
33,rithik puri,23.000000,5.150000,7.175000,0.050000,12.275000
34,ryan swatscheno,44.500000,4.600000,6.650000,0.000000,11.250000
35,samuel phillips,15.500000,5.500000,8.375000,0.250000,13.625000
36,shane wiskus,12.000000,5.733333,7.866667,0.200000,13.400000
37,taylor burkhart,9.428571,6.000000,7.728571,0.014286,13.714286
38,taylor christopulos,11.500000,5.500000,8.125000,0.050000,13.575000
39,toby liang,19.500000,5.000000,8.150000,0.000000,13.150000
40,yul moldauer,6.000000,5.640000,8.513200,0.000000,14.153200

In [208]:
fxavg = fx.groupby('name').mean().reset_index()

In [209]:
fx_sorted = fxavg.sort_values(by='Score', ascending=False)

In [210]:
fx_sorted['Apparatus'] = 'fx'

In [211]:
fx_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 41 entries, 31 to 34
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       41 non-null     object
 1   Rank       41 non-null     float64
 2   D_Score    41 non-null     float64
 3   E_Score    41 non-null     float64
 4   Penalty    41 non-null     float64
 5   Score      41 non-null     float64
 6   Apparatus  41 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.6+ KB

# sr

In [212]:
sr['name'] = sr['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = sr['name'].value_counts()

# Filter out entries with only one occurrence
sr_filtered = sr[sr['name'].isin(name_counts.index[name_counts > 1])]

In [213]:
sr=sr_filtered.copy()
sravg = sr.groupby('name').mean().reset_index()

In [214]:
sr_sorted = sravg.sort_values(by='Score', ascending=False)

In [215]:
sr_sorted['Apparatus'] = 'sr'

In [216]:
sr_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 42 entries, 9 to 35
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       42 non-null     object
 1   Rank       42 non-null     float64
 2   D_Score    42 non-null     float64
 3   E_Score    42 non-null     float64
 4   Penalty    42 non-null     float64
 5   Score      42 non-null     float64
 6   Apparatus  42 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.6+ KB

# vt

In [217]:
vt['name'] = vt['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = vt['name'].value_counts()

# Filter out entries with only one occurrence
vt_filtered = vt[vt['name'].isin(name_counts.index[name_counts > 1])]

In [218]:
vt=vt_filtered.copy()
vtavg = vt.groupby('name').mean().reset_index()

In [219]:
vt_sorted = vtavg.sort_values(by='Score', ascending=False)

In [220]:
vt_sorted['Apparatus'] = 'vt'

In [221]:
vt_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, 21 to 29
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       35 non-null     object
 1   Rank       35 non-null     float64
 2   D_Score    35 non-null     float64
 3   E_Score    35 non-null     float64
 4   Penalty    35 non-null     float64
 5   Score      35 non-null     float64
 6   Apparatus  35 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.2+ KB

# pb

In [227]:
pb['name'] = pb['name'].replace('frederick richard', 'frederick nathaniel richard')

name_counts = pb['name'].value_counts()

# Filter out entries with only one occurrence
pb_filtered = pb[pb['name'].isin(name_counts.index[name_counts > 1])]

In [228]:
pb=pb_filtered.copy()
pbavg = pb.groupby('name').mean().reset_index()

In [229]:
pb_sorted = pbavg.sort_values(by='Score', ascending=False)

In [230]:
pb_sorted['Apparatus'] = 'pb'

In [233]:
pb_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 47 entries, 8 to 19
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       47 non-null     object
 1   Rank       47 non-null     float64
 2   D_Score    47 non-null     float64
 3   E_Score    47 non-null     float64
 4   Penalty    47 non-null     float64
 5   Score      47 non-null     float64
 6   Apparatus  47 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.9+ KB

# ph

In [234]:
ph['name'] = ph['name'].replace('frederick richard', 'frederick nathaniel richard')

In [235]:
name_counts = ph['name'].value_counts()

# Filter out entries with only one occurrence
ph_filtered = ph[ph['name'].isin(name_counts.index[name_counts > 1])]

In [236]:
ph=ph_filtered.copy()
phavg = ph.groupby('name').mean().reset_index()

In [237]:
ph_sorted = phavg.sort_values(by='Score', ascending=False)

In [238]:
ph_sorted['Apparatus'] = 'ph'

In [239]:
ph_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 47 entries, 38 to 20
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       47 non-null     object
 1   Rank       47 non-null     float64
 2   D_Score    47 non-null     float64
 3   E_Score    47 non-null     float64
 4   Penalty    47 non-null     float64
 5   Score      47 non-null     float64
 6   Apparatus  47 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.9+ KB

# hb

In [245]:
hb['name'] = hb['name'].replace('frederick richard', 'frederick nathaniel richard')

In [246]:
name_counts = hb['name'].value_counts()

# Filter out entries with only one occurrence
hb_filtered = hb[hb['name'].isin(name_counts.index[name_counts > 1])]

In [247]:
hb=hb_filtered.copy()
hbavg = hb.groupby('name').mean().reset_index()

In [248]:
hb_sorted = hbavg.sort_values(by='Score', ascending=False)

In [249]:
hb_sorted['Apparatus'] = 'hb'

In [250]:
hb_sorted.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44 entries, 1 to 13
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       44 non-null     object
 1   Rank       44 non-null     float64
 2   D_Score    44 non-null     float64
 3   E_Score    44 non-null     float64
 4   Penalty    44 non-null     float64
 5   Score      44 non-null     float64
 6   Apparatus  44 non-null     object
dtypes: float64(5), object(2)
memory usage: 2.8+ KB

In [251]:
hb=hb_sorted.copy()
vt=vt_sorted.copy()
sr=sr_sorted.copy()
fx=fx_sorted.copy()
pb=pb_sorted.copy()
ph=ph_sorted.copy()

In [252]:
hb.head(1)

           name  Rank  D_Score  E_Score  Penalty    Score Apparatus
1  brody malone   2.2     6.05   8.3532      0.0  14.4032        hb

In [253]:
vt.head(1)

          name   Rank  D_Score   E_Score  Penalty      Score Apparatus
21  khoi young  4.125    5.425  9.339375    0.025  14.739375        vt

In [254]:
sr.head(1)

                  name  Rank  D_Score  E_Score  Penalty    Score Apparatus
9  donnell whittenburg   3.9     5.98   8.4398      0.0  14.4198        sr

In [255]:
fx.head(1)

         name  Rank  D_Score  E_Score  Penalty     Score Apparatus
31  paul juda  12.0     5.65  8.56225    0.025  14.18725        fx

In [256]:
pb.head(1)

              name      Rank   D_Score   E_Score  Penalty      Score Apparatus
8  curran phillips  2.111111  6.733333  8.029556      0.0  14.762889        pb

In [257]:
ph.head(1)

                  name  Rank   D_Score   E_Score  Penalty      Score Apparatus
38  stephen nedoroscik   3.0  6.414286  7.840286      0.0  14.254571        ph

In [258]:
df = pd.concat([hb, vt, sr, fx, pb, ph], ignore_index=True)

In [259]:
df

,name,Rank,D_Score,E_Score,Penalty,Score,Apparatus
0,brody malone,2.200000,6.050000,8.353200,0.00,14.403200,hb
1,paul juda,3.800000,5.360000,8.666400,0.00,14.026400,hb
2,frederick nathaniel richard,24.166667,5.833333,7.761000,0.05,13.544333,hb
3,fred richard,11.333333,5.733333,7.783333,0.00,13.516667,hb
4,michael jaroh,6.000000,5.150000,8.350000,0.00,13.500000,hb
...,...,...,...,...,...,...,...
251,kameron nelson,32.000000,3.600000,6.700000,0.00,10.300000,ph
252,tyler flores,47.000000,4.400000,5.625000,0.00,10.025000,ph
253,kazuki hayashi,48.000000,3.850000,5.975000,0.00,9.825000,ph
254,drake andrews,47.500000,3.400000,7.925000,2.00,9.325000,ph
255,izaiha mlay,53.500000,3.350000,5.000000,0.00,8.350000,ph

In [260]:
# df.to_csv('usa_men_apparatus.csv', index=False)